SOAP/test/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:request>
            <gs:name>Poland</gs:name>
        </gs:request>
    </soapenv:Body>
</soapenv:Envelope>